const Map<String, String> yekan = {
  '0': '',
  '1': 'یک',
  '2': 'دو',
  '3': 'سه',
  '4': 'چهار',
  '5': 'پنج',
  '6': 'شش',
  '7': 'هفت',
  '8': 'هشت',
  '9': 'نه',
};
const Map<String, String> dahgan = {
  '0': '',
  '2': 'بیست',
  '3': 'سی',
  '4': 'چهل',
  '5': 'پنجاه',
  '6': 'شصت',
  '7': 'هفتاد',
  '8': 'هشتاد',
  '9': 'نود',
};
const Map<String, String> sadgan = {
  '0': '',
  '1': 'صد',
  '2': 'دویست',
  '3': 'سیصد',
  '4': 'چهارصد',
  '5': 'پانصد',
  '6': 'ششصد',
  '7': 'هفتصد',
  '8': 'هشتصد',
  '9': 'نهصد',
};

const Map<String, String> exception = {
  '10': 'ده',
  '11': 'یازده',
  '12': 'دوازده',
  '13': 'سیزده',
  '14': 'چهارده',
  '15': 'پانزده',
  '16': 'شانزده',
  '17': 'هفده',
  '18': 'هجده',
  '19': 'نوزده',
};